Revit 2026 API

# ImageExportOptionsPixelSize Property

---

The pixel size of an image in one direction. Used only if ZoomType is FitToPage.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int PixelSize { get; set; }
```
```vb
Public Property PixelSize As Integer
	Get
	Set
```
```cpp
public:
property int PixelSize {
	int get ();
	void set (int value);
}
```
```fsharp
member PixelSize : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The PixelSize value is outside the permitted range. |

The default is 512 pixels.

#### Reference

ImageExportOptions Class

Autodesk.Revit.DB Namespace